noahjohnson0/mockingbird/sdkconfig.defaults
# sdkconfig defaults for esp32-fw.
# Target: ESP32-S3 with 8 MB flash and OCT PSRAM (MicroLink requires PSRAM).

# ---- Target ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash ----
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# ---- Custom partition table with two OTA slots ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- OTA safety: rollback if the new app fails to mark itself valid ----
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- PSRAM (required by MicroLink) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- lwIP — WireGuard wants headroom ----
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768

# ---- mbedTLS — Noise protocol needs ChaCha20-Poly1305 (MicroLink) + TLS for HTTPS OTA ----
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# ---- WiFi tuning for WireGuard latency ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# ---- CPU ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- Watchdog — TLS handshakes can be slow on first boot ----
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# ---- Main task stack — MicroLink expects 8 KB ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- HTTP server (control + OTA endpoint) ----
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ---- Logging ----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
